###########################################################################
#
# Generated by : Version 9.1 Build 222 10/21/2009 SJ Web Edition
#
# Project      : SeaQuestTrig1
# Revision     : SeaQuestTrig1
#
# Date         : Sun Oct 02 14:25:32 CDT 2016
#
###########################################################################
 
 
# WARNING: Expected ENABLE_CLOCK_LATENCY to be set to 'ON', but it is set to 'OFF'
#          In SDC, create_generated_clock auto-generates clock latency
#
# ------------------------------------------
#
# Create generated clocks based on PLLs
derive_pll_clocks -use_tan_name
#
# ------------------------------------------


# Original Clock Setting Name: CK62setting
create_clock -period "16.000 ns" \
             -name {GLB1} {GLB1}
# ---------------------------------------------


# Original Clock Setting Name: GIN[0]
create_clock -period "18.832 ns" \
             -name {GIN[0]} {GIN[0]}
# ---------------------------------------------

# ** Clock Latency
#    -------------

# ** Clock Uncertainty
#    -----------------

# ** Multicycles
#    -----------
# QSF: -name MULTICYCLE 4 -from *RLCLK* -to *
set_multicycle_path -end -setup -from [get_keepers {*RLCLK*}] -to [get_keepers *] 4
set_multicycle_path -end -hold -from [get_keepers {*RLCLK*}] -to [get_keepers *] 3

# QSF: -name MULTICYCLE 4 -from coin_reference:inst2|SCRATCH[* -to *
set_multicycle_path -end -setup -from [get_keepers {coin_reference:inst2|SCRATCH[*}] -to [get_keepers *] 4
set_multicycle_path -end -hold -from [get_keepers {coin_reference:inst2|SCRATCH[*}] -to [get_keepers *] 3

# QSF: -name MULTICYCLE 4 -from *MCL* -to *
set_multicycle_path -end -setup -from [get_keepers {*MCL*}] -to [get_keepers *] 4
set_multicycle_path -end -hold -from [get_keepers {*MCL*}] -to [get_keepers *] 3

# ** Cuts
#    ----

# ** Input/Output Delays
#    -------------------




# ** Tpd requirements
#    ----------------

# ** Setup/Hold Relationships
#    ------------------------

# ** Tsu/Th requirements
#    -------------------


# ** Tco/MinTco requirements
#    -----------------------

#
# Entity Specific Timing Assignments found in
# the Timing Analyzer Settings report panel
#


# ---------------------------------------------
# The following clock group is added to try to 
# match the behavior of:
#   CUT_OFF_PATHS_BETWEEN_CLOCK_DOMAINS = ON
# ---------------------------------------------

set_clock_groups -asynchronous \
                 -group { \
                       GLB1 \
                        } \
                 -group { \
                       altpll0:inst7|altpll:altpll_component|_clk0 \
                       altpll0:inst7|altpll:altpll_component|_clk1 \
                       GIN[0] \
                        } \

# ---------------------------------------------

